In [17]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv('Employee.csv')

In [3]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [4]:
df.shape

(4653, 9)

In [6]:
#Average Age 
df['Age'].mean()

29.393294648613796

In [10]:
#Most Common City
df['City'].value_counts()

City
Bangalore    2228
Pune         1268
New Delhi    1157
Name: count, dtype: int64

In [11]:
#Most Common Education
df['Education'].value_counts()

Education
Bachelors    3601
Masters       873
PHD           179
Name: count, dtype: int64

In [16]:
df['JoiningYear'].value_counts()

JoiningYear
2017    1108
2015     781
2014     699
2013     669
2016     525
2012     504
2018     367
Name: count, dtype: int64

In [23]:
df.sample(10)

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
3556,Masters,2018,New Delhi,3,31,Female,Yes,2,1
698,Bachelors,2017,New Delhi,3,27,Female,Yes,5,0
447,Bachelors,2013,Pune,2,25,Male,No,3,1
4004,Bachelors,2015,Bangalore,3,34,Male,No,4,0
505,Bachelors,2018,Pune,3,26,Male,No,4,1
878,Bachelors,2017,Bangalore,2,27,Male,No,5,0
2249,Bachelors,2012,Bangalore,3,29,Male,Yes,2,0
1839,PHD,2017,Bangalore,3,24,Female,No,2,0
1623,Bachelors,2012,Pune,3,26,Male,No,4,0
4081,Bachelors,2014,Pune,3,27,Male,No,5,1

In [21]:
df.isnull().any()

Education                    False
JoiningYear                  False
City                         False
PaymentTier                  False
Age                          False
Gender                       False
EverBenched                  False
ExperienceInCurrentDomain    False
LeaveOrNot                   False
dtype: bool

In [22]:
df.duplicated().sum()

1889

In [35]:
np.random.seed(42)  # Ensures reproducibility
df['Income'] = np.random.randint(30000, 100000, df.shape[0])

In [38]:
df.sample(10)

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot,Income
2360,Bachelors,2014,Bangalore,3,30,Male,No,2,1,38472
3796,Bachelors,2016,Pune,2,37,Female,No,3,1,34131
865,Masters,2017,Pune,2,26,Male,No,4,0,67430
1535,Bachelors,2015,Pune,2,25,Female,Yes,3,1,45577
4069,Masters,2013,New Delhi,2,22,Male,Yes,0,1,35898
2344,Bachelors,2012,Bangalore,3,30,Female,No,2,0,59516
3557,PHD,2015,Bangalore,3,31,Male,No,3,0,63665
4415,Bachelors,2016,Bangalore,3,31,Male,No,5,0,35247
1320,Bachelors,2017,New Delhi,2,27,Male,No,5,0,51563
1921,Bachelors,2017,Bangalore,2,28,Female,No,2,1,56189

In [48]:
print("Mean Income:", df['Income'].mean())
print("Minimum Income:", df['Income'].min())
print("Maximum Income:", df['Income'].max())
print("Median Income:", df['Income'].median())
print("Standard Deviation of Income:", df['Income'].std())
print("Variance of Income:", df['Income'].var())
print("Mode of Age:", df['Income'].mode()[0])

Mean Income: 64372.03997421019
Minimum Income: 30055
Maximum Income: 99967
Median Income: 63828.0
Standard Deviation of Income: 20100.386497401498
Variance of Income: 404025537.3449204
Mode of Age: 33748

In [47]:
print("Mean Age:", df['Age'].mean())
print("Minimum Age:", df['Age'].min())
print("Maximum Age:", df['Age'].max())
print("Median Age:", df['Age'].median())
print("Standard Deviation of Age:", df['Age'].std())
print("Variance of Age:", df['Age'].var())
print("Mode of Age:", df['Age'].mode()[0])

Mean Age: 29.393294648613796
Minimum Age: 22
Maximum Age: 41
Median Age: 28.0
Standard Deviation of Age: 4.826087009126047
Variance of Age: 23.29111581965519
Mode of Age: 26

In [49]:
df['Income'].value_counts()

Income
39435    3
76163    3
33748    3
94925    3
47087    2
        ..
90233    1
55537    1
52612    1
36471    1
69516    1
Name: count, Length: 4498, dtype: int64

In [56]:
def classify_income(income):
    if income < 40000:
        return 'Low Income'
    elif income > 80000:
        return 'High Income'
    else:
        return 'Moderate Income'

In [59]:
def categorize_age(age):
    if age < 25:
        return "Experienced"
    elif age > 18 and age <= 60:
        return "Fresher"
    else:
        return "Retired"

In [60]:
df['Income Category'] = df['Income'].apply(classify_income)
df['Age Category'] = df['Age'].apply(categorize_age)

In [62]:
df.sample(10)

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot,Income,Income Category,Age Category
4124,Bachelors,2013,Bangalore,1,27,Female,No,5,0,37566,Low Income,Fresher
2286,Masters,2017,New Delhi,2,26,Male,No,4,0,85426,High Income,Fresher
2317,Bachelors,2014,Bangalore,1,28,Male,No,2,1,85915,High Income,Fresher
3032,Masters,2012,Bangalore,2,32,Male,No,3,1,66777,Moderate Income,Fresher
719,Bachelors,2016,Bangalore,3,24,Male,No,2,0,54818,Moderate Income,Experienced
280,Bachelors,2014,Bangalore,3,25,Male,No,3,0,96320,High Income,Fresher
1573,Bachelors,2016,Pune,3,24,Male,No,2,0,39108,Low Income,Experienced
4390,Masters,2017,New Delhi,2,26,Female,No,4,0,81033,High Income,Fresher
2937,Masters,2017,Bangalore,2,27,Male,No,5,1,63870,Moderate Income,Fresher
1546,Bachelors,2018,Pune,3,24,Male,Yes,2,1,61890,Moderate Income,Experienced

In [65]:
df.groupby(['Age Category']).Income.mean()

Age Category
Experienced    64553.213693
Fresher        64351.103572
Name: Income, dtype: float64

In [66]:
df.groupby(['Income Category']).Income.mean()

Income Category
High Income        89872.860173
Low Income         34965.278665
Moderate Income    59837.931624
Name: Income, dtype: float64

In [67]:
df.groupby(['Education']).Income.mean()

Education
Bachelors    64385.873924
Masters      64494.807560
PHD          63494.988827
Name: Income, dtype: float64